[
    {
        "slug": "denny-r-lame",
        "name": "Denny R. Lame",
        "role": "Reporter — NY State News",
        "twitter": "@LameRlame7",
        "twitterUrl": "https://x.com/LameRlame7",
        "bio": "Denny has built a name in the newsroom as a reporter who refuses to let go of a lead. He’s the one who keeps calling sources when others stop picking up the phone, and he’s known to spend late nights chasing down the last detail that gives a story weight.Colleagues often describe him as relentless, but also fair. He believes accuracy matters more than speed, yet his stories still carry urgency because he gets to the truth fast. From political disputes to neighborhood issues, Denny’s byline signals that readers are about to get the kind of reporting that digs deeper than the press release.When readers see his work, they know the facts have been tested and the story has been pushed as far as it can go."
    },
    {
        "slug": "craig-a-smith",
        "name": "Craig A. Smith",
        "role": "Reporter — NY State News",
        "twitter": "@Craig_ASmith",
        "twitterUrl": "https://x.com/Craig_ASmith",
        "bio": "Craig has always been the one in the newsroom who keeps asking “why?” and “what does this really mean?” That curiosity is what drives his reporting. He’s not the type to settle for surface-level answers, and his readers benefit from that persistence.When news breaks, Craig has a calmness that others lean on. While some rush to publish, he takes the extra step to check a fact, confirm a detail, or ask one more question. His colleagues often describe him as steady and thoughtful, the kind of reporter who makes sure a story is solid before it goes out.His work reflects that approach — stories that are clear, complete, and give readers more than just the headline. Craig believes good reporting should leave people with a better understanding of the issue, not just a summary of events."
    },
    {
        "slug": "edwin-v-christopher",
        "name": "Edwin V. Christopher",
        "role": "Reporter — NY State News",
        "twitter": "@Edwin_v_christ",
        "twitterUrl": "https://x.com/Edwin_v_christ",
        "bio": "Edwin doesn’t rush. While others are chasing the breaking line, he’s the one checking the second source, digging through the extra page of documents, or calling back to make sure a quote is exact. It’s not flashy, but it’s the kind of work that makes readers trust what they’re reading.Colleagues say Edwin has a calm way of handling the news cycle. When things get noisy, he keeps his head down and focuses on what can be proven. His reporting doesn’t come out first, but it often ends up being the one that holds up when the dust settles.Readers know his stories for their balance. They aren’t written to stir the pot — they’re written to give people a clear picture of what actually happened. That’s why his byline has become one of the most trusted on our site."
    },
    {
        "slug": "martha-w-johnson",
        "name": "Martha W. Johnson",
        "role": "Reporter — NY State News",
        "twitter": "@Mar_tha_Johnson",
        "twitterUrl": "https://x.com/Mar_tha_Johnson",
        "bio": "Denny has built a name in the newsroom as a reporter who refuses to let go of a lead. He’s the one who keeps calling sources when others stop picking up the phone, and he’s known to spend late nights chasing down the last detail that gives a story weight.Colleagues often describe him as relentless, but also fair. He believes accuracy matters more than speed, yet his stories still carry urgency because he gets to the truth fast. From political disputes to neighborhood issues, Denny’s byline signals that readers are about to get the kind of reporting that digs deeper than the press release.When readers see his work, they know the facts have been tested and the story has been pushed as far as it can go."
    },
    {
        "slug": "sean-t-martinez",
        "name": "Sean T. Martinez",
        "role": "Reporter — NY State News",
        "twitter": "@sean_t_martinez",
        "twitterUrl": "https://x.com/sean_t_martinez",
        "bio": "Sean doesn’t believe news should be complicated. His style is straightforward: take a topic that feels overwhelming, cut through the jargon, and explain it in a way anyone can follow. Whether he’s covering policy debates, local issues, or big-picture trends, Sean makes sure his reporting connects with everyday readers.In the newsroom, he’s known for asking the kinds of questions that others might skip — the ones that turn a confusing story into something clear and useful. Readers often say his work “just makes sense,” and that’s exactly what he aims for.For Sean, journalism isn’t about showing off expertise — it’s about making sure people walk away with real understanding."
    }
]